In [1]:
# 1 处理缺失数据
# 2 处理重复数据
# 3 处理字符串操作
# 4 分析数据转换工具

import numpy as np
import pandas as pd

# the path of dataset
dataset_path = './../dataset/'

In [2]:
# 1 数据缺失

# 在数据分析工作中，数据缺失是一种很常见的现象
# pandas 对象的所有描述性统计默认不包含缺失数据
# 对于数值型数据，pandas 使用浮点值 NaN 表示缺失数据，称其 哨兵值，方便检测
# NaN not a number

# pd.object.isnull() 检测数据缺失
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# pandas 中采用 R 语言的惯用方，即 缺失值表示为 NA not available
# 在统计应用中，NA数据可能是不存在的数据或者虽然存在，但是没有观察到（如数据采集中发生了问题）
# 在进行数据清洗以进行分析时，最好直接对缺失数据进行分析，
#   以判断数据采集的问题或者缺失数据可能导致的偏差

# Python 内置的 None 值在对象数组中也是 NA
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
# 方法     说明
# dropna   根据各标签的值中是否存在缺失值对轴标签进行过滤，可通过阈值调节对缺失值的容忍度
# fillna   用指定值或者插值方法（ffill或者bfill）填充缺失数据
# isnull   返回含有布尔值的对象，表示那些是缺失值，该对象类型与源类型一致
# notnull  isnull 的否定式

In [6]:
# 过滤除掉缺失值
# 通过pandas.isnull或布尔索引的手工方法， 但dropna可能会更实用一些
# 对于一个Series， dropna返回一个仅含非空数据和索引值的Series
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
# 上一条语句 等价于
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
# 对于DataFrame对象， 事情就有点复杂了。 你可能希望丢弃全NA或含有NA的行或列。 
# dropna默认丢弃任何含有缺失值的行
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna()

print(data)
print("========================")
print(cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0
========================
     0    1    2
0  1.0  6.5  3.0

In [9]:
# 传入how='all'将只丢弃全为NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
# 用这种方式丢弃列， 只需传入axis=1即可：
data[4] = NA
print(data)
print("==============================")
data.dropna(axis=1, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN
==============================

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
# 滤除 DataFrame行的问题涉及时间序列数据。 
# 假设只想留下一部分观测数据，可以用thresh参数实现此目的：
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.757655       NaN       NaN
1  1.267778       NaN       NaN
2 -1.403592       NaN  0.183801
3 -0.121184       NaN -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [12]:
df.dropna()

          0         1         2
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [14]:
df.dropna(thresh=2)

          0         1         2
2 -1.403592       NaN  0.183801
3 -0.121184       NaN -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [16]:
# 填充缺失数据
# 可能不想滤除缺失数据（有可能会丢弃跟它有关的其他数据），
# 而是希望通过其他方式填补那些“空洞”。 
# 对于大多数情况而言， fillna方法是最主要的函数。 
# 通过一个常数调用fillna就会将缺失值替换为那个常数值：

print(df)
print("=============================")
df.fillna(0)

          0         1         2
0 -0.757655       NaN       NaN
1  1.267778       NaN       NaN
2 -1.403592       NaN  0.183801
3 -0.121184       NaN -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901
=============================

          0         1         2
0 -0.757655  0.000000  0.000000
1  1.267778  0.000000  0.000000
2 -1.403592  0.000000  0.183801
3 -0.121184  0.000000 -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [17]:
# 若是通过一个字典调用fillna， 就可以实现对不同的列填充不同的值
print(df)
print("=============================")
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.757655       NaN       NaN
1  1.267778       NaN       NaN
2 -1.403592       NaN  0.183801
3 -0.121184       NaN -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901
=============================

          0         1         2
0 -0.757655  0.500000  0.000000
1  1.267778  0.500000  0.000000
2 -1.403592  0.500000  0.183801
3 -0.121184  0.500000 -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [19]:
# fillna默认会返回新对象， 但也可以对现有对象进行就地修改：
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.757655  0.000000  0.000000
1  1.267778  0.000000  0.000000
2 -1.403592  0.000000  0.183801
3 -0.121184  0.000000 -0.445881
4 -0.205747 -0.761412 -1.343743
5 -1.303551 -0.814922  1.028238
6  0.983137 -0.184285 -1.952901

In [20]:
# 对reindexing有效的那些插值方法也可用于fillna：
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.309316 -0.319213  1.111520
1 -0.220893 -0.926356 -0.455549
2 -1.300133       NaN  2.036537
3 -1.488090       NaN -2.257564
4 -0.592548       NaN       NaN
5 -0.231507       NaN       NaN

In [21]:
# 按照 列 向后填充
df.fillna(method='ffill')

          0         1         2
0 -0.309316 -0.319213  1.111520
1 -0.220893 -0.926356 -0.455549
2 -1.300133 -0.926356  2.036537
3 -1.488090 -0.926356 -2.257564
4 -0.592548 -0.926356 -2.257564
5 -0.231507 -0.926356 -2.257564

In [22]:
# 限制填充
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.309316 -0.319213  1.111520
1 -0.220893 -0.926356 -0.455549
2 -1.300133 -0.926356  2.036537
3 -1.488090 -0.926356 -2.257564
4 -0.592548       NaN -2.257564
5 -0.231507       NaN -2.257564

In [23]:
# 只要有些创新， 可以利用fillna实现许多别的功能。 
# 比如说， 你可以传入Series的平均值或中位数
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [24]:
# fillna 函数的可选参数
# 参数    说明
# value   用于填充缺失值的标量值或者字典
# method  插值方式，默认为 ffill
# axis    待填充的轴，默认为 axis=0
# inplace 修改调用者对象而不产生副本
# limit   对于向前和向后填充，可以连续填充的最大数量

In [25]:
# 移除重复数据

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# DataFrame 的 duplicated 方法返回一个布尔型 Series， 
#  表示各行是否是重复行（前面出现过的行） ：
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
# 与此相关的 drop_duplicates 方法， 
# 它会返回一个 DataFrame， 重复的数组会标为 False 删除掉了
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
# 这两个方法默认会判断全部列，也可以指定部分列进行重复项判断。 
# 假设还有一列值， 且只希望根据 k1列 过滤重复项
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [30]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [31]:
# duplicated 和 drop_duplicates 默认保留的是第一个出现的值组合
# 传入 keep='last' 则保留最后一个
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [33]:
# 利用函数或者映射进行数据转换
# 对于许多数据集， 你可能希望根据数组、 Series或DataFrame列中的值来实现转换工作
# 这组有关肉类的数据：
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
# 想要添加一列表示该肉类食物来源的动物类型
# 编写一个不同肉类到动物的映射
meat_to_animal = {
                  'bacon': 'pig',
                  'pulled pork': 'pig',
                  'pastrami': 'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'}
# Series 的 map方法可以接受一个函数或含有映射关系的字典型对象
# 但是这里有一个小问题， 即有些肉类的首字母大写了， 而另一些则没有
# 因此，需要使用Series 的 str.lower方法， 将各个值转换为小写
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [35]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
# 也可以传入一个能够完成全部这些工作的函数
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [37]:
# 使用map是一种实现元素级转换以及其他数据清理工作的便捷方式

In [38]:
# 替换值
# fillna 方法填充缺失值可以看做替换的一种特殊情况
# replace 则提供一种实现该功能的方式
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
# -999这个值可能是一个表示缺失数据的标记值。 
# 要将其替换为 pandas 能够理解的NA值，
# 可以利用 replace 来产生一个新的Series（除非传入inplace=True）
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
# 希望一次性替换多个值， 可以传入一个由待替换值组成的列表以及一个替换值：
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
# 让每个值有不同的替换值， 可以传递一个替换列表
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
# 传入的参数也可以是字典：
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
# 笔记： data.replace方法与data.str.replace不同， 后者做的是字符串的元素级替换

In [45]:
# 重命名轴索引

# 跟Series中的值一样， 轴标签也可以通过函数或映射进行转换， 
# 从而得到一个新的不同标签的对象。 
# 轴还可以被就地修改， 而无需新建一个数据结构
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
# 将其赋值给index， 这样就可以对DataFrame进行就地修改：
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
# 想要创建数据集的转换版（而不是修改原始数据） ， 
# 比较实用的方法是rename：
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
# 特别说明一下， rename可以结合字典型对象实现对部分轴标签的更新
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
# rename可以实现复制 DataFrame并对其索引和列标签进行赋值。 
# 如果希望就地修改某个数据集，传入inplace=True即可
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [51]:
# 离散化和面元划分

# 为了便于分析， 连续数据常常被离散化或拆分为“面元”（bin）
# 假设有一组人员数据， 希望将它们划分为不同的年龄组：
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# 接下来将这些数据划分为 “18到25”、 “26到35”、 “35到60”以及“60以上”几个面元
# 要实现该功能，需要使用 pandas 的 cut 函数
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [52]:
# pandas 返回的是一个特殊的 Categorical 对象。 
# 结果展示了 pandas.cut 划分的面元 可以将其看做一组表示面元名称的字符串。 
# 它的底层含有一个表示不同分类名称的类型数组， 以及一个 codes 属性中的年龄数据的标签：
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [53]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [54]:
# pd.value_counts(cats)是pandas.cut结果的面元计数
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [55]:
# 跟“区间”的数学符号一样， 圆括号表示开端， 而方括号则表示闭端（包括） 
# 哪边是闭端可以通过 right=False 进行修改
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [56]:
# 可 以通过传递一个列表或数组到labels， 设置自己的面元名称
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [57]:
# 如果向cut传入的是面元的数量而不是确切的面元边界， 
# 则它会根据数据的最小值和最大值计算等长面元。

# 均匀分布的数据分成四组
data = np.random.rand(20)
# 选项precision=2， 限定小数只有两位
pd.cut(data, 4, precision=2)

[(0.8, 1.0], (0.18, 0.39], (0.18, 0.39], (0.8, 1.0], (0.59, 0.8], ..., (0.8, 1.0], (0.18, 0.39], (0.39, 0.59], (0.39, 0.59], (0.59, 0.8]]
Length: 20
Categories (4, interval[float64]): [(0.18, 0.39] < (0.39, 0.59] < (0.59, 0.8] < (0.8, 1.0]]

In [59]:
# qcut是一个非常类似于cut的函数， 它可以根据样本分位数对数据进行面元划分。 
# 根据数据的分布情况， cut可能无法使各个面元中含有相同数量的数据点。 
# 而qcut由于使用的是样本分位数， 因此可以得到大小基本相等的面元
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-0.617, 0.065], (-0.617, 0.065], (-0.617, 0.065], (0.732, 3.441], (-0.617, 0.065], ..., (0.065, 0.732], (-0.617, 0.065], (-3.319, -0.617], (0.732, 3.441], (-3.319, -0.617]]
Length: 1000
Categories (4, interval[float64]): [(-3.319, -0.617] < (-0.617, 0.065] < (0.065, 0.732] < (0.732, 3.441]]

In [60]:
pd.value_counts(cats)

(0.732, 3.441]      250
(0.065, 0.732]      250
(-0.617, 0.065]     250
(-3.319, -0.617]    250
dtype: int64

In [61]:
# 与cut类似， 你也可以传递自定义的分位数（0到1之间的数值， 包含端点）
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.236, 0.065], (-1.236, 0.065], (-1.236, 0.065], (0.065, 1.354], (-1.236, 0.065], ..., (0.065, 1.354], (-1.236, 0.065], (-1.236, 0.065], (0.065, 1.354], (-1.236, 0.065]]
Length: 1000
Categories (4, interval[float64]): [(-3.319, -1.236] < (-1.236, 0.065] < (0.065, 1.354] < (1.354, 3.441]]

In [62]:
# 检测和过滤异常值

# 过滤或变换异常值（outlier） 在很大程度上就是运用数组运算。 
# 来看一个含有正态分布数据的 DataFrame：
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.041737    -0.003059     0.032145     0.023746
std       1.001498     1.057742     1.029331     0.985393
min      -3.009630    -2.743474    -2.918540    -3.257359
25%      -0.630066    -0.668754    -0.663797    -0.623704
50%       0.056037     0.013145     0.025747     0.021145
75%       0.739702     0.701268     0.753771     0.669538
max       2.753000     3.603299     3.398534     3.113247

In [63]:
# 假设想要找出某列（第三列）中绝对值大小超过3的值：
col = data[2]
col[np.abs(col) > 3]

93     3.398534
465    3.138356
589    3.241708
949    3.024680
Name: 2, dtype: float64

In [64]:
# 要选出全部含有“超过3或－3的值”的行， 
# 可以在布尔型DataFrame中使用any方法
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
69   0.453806  0.961512 -0.822347  3.113247
93  -0.180454  0.148549  3.398534  0.661403
189  0.555782 -0.930924 -0.594811 -3.257359
265 -0.450546 -0.994003 -1.106171 -3.178510
465 -0.488726 -1.284519  3.138356  0.488605
589  0.461926 -0.206149  3.241708  0.778587
752 -3.009630 -1.191574  2.255902  0.380189
884 -0.037910  3.603299 -1.415062  1.176653
949  0.511038  0.025885  3.024680  0.485520

In [65]:
# 这些条件， 就可以对值进行设置
# 下面的代码可以将值限制在区间 -3 到 3 以内
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.041747    -0.003663     0.031342     0.024068
std       1.001469     1.055853     1.026894     0.983654
min      -3.000000    -2.743474    -2.918540    -3.000000
25%      -0.630066    -0.668754    -0.663797    -0.623704
50%       0.056037     0.013145     0.025747     0.021145
75%       0.739702     0.701268     0.753771     0.669538
max       2.753000     3.000000     3.000000     3.000000

In [66]:
# 根据数据的值是正还是负， np.sign(data)可以生成1和-1
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1  1.0  1.0  1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

In [67]:
# 排列和随机采样

# 利用 numpy.random.permutation 函数可以轻松实现对 Series 或 DataFrame 的列的排列工作
# （permuting， 随机重排序），通过需要排列的轴的长度调用 permutation，可产生一个表示新顺序的整数数组：
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 1, 3, 4])

In [68]:
# 可以在基于iloc的索引操作或take函数中使用该数组了
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [69]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [70]:
# 如果不想用替换的方式选取随机子集， 可以在Series和DataFrame上使用sample方法
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [71]:
# 要通过替换的方式产生样本（允许重复选择） ， 可以传递replace=True到sample
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
2   -1
3    6
0    5
3    6
3    6
4    4
1    7
2   -1
4    4
dtype: int64

In [1]:
# 计算指标/哑变量
import numpy as np
import pandas as pd

# 另一种常用于统计建模或者机器学习的转换方式：
#     将分类变量（categorical variable）转换为 哑变量 或者 指标矩阵

# DataFrame 的某一列中含有 k 个不同的值，则可以派生出一个 k 列矩阵 或者 DataFrame（其值全为 1 & 0）
# pandas 有一个 get_dummies 函数可以实现该功能  dummy——假
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [2]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [3]:
# 从结果可知，从 ‘key’ 列 对照 一致则为1，不一致则为0

In [4]:
# 有时候，需要给指标 DataFrame 的列加上一个前缀，以便于与其他数据进行合并
# pandas 的 get_dummies 的 prefix 参数可以实现该功能 prefix——前缀
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [5]:
# 新的数据
df_new = df[['data1']]
df_new

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [6]:
# 合并数据
df_with_dummy = df_new.join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [9]:
# 如果 DataFrame 中某一行同属于多个分类，则情况复杂
# MovieLens 1M 数据集
dataset_path = './../dataset/'

mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table(dataset_path + 'ml-1m/movies.dat', sep='::', header=None, names=mnames)

movies.head(10)

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:6: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [10]:
# 要为每个 genres 添加指标变量就需要进行数据规整操作
# 首先从数据集中抽取出不同的 genre 值 （电影类型）
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))

genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [12]:
# 构建指标 DataFrame 的方法之一，从一个空的 DataFrame 开始
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns = genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [13]:
# 现在， 迭代每一部电影， 并将dummies各行的条目设为1。 
# 要这么做，使用 dummies.columns 来计算每个类型的列索引：
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [14]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [15]:
# 然后根据索引，使用 iloc 设定值
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [16]:
# 根据索引，将其与movies 合并起来
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.tail()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [17]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [18]:
# Note: 对于大数据而言，这样构建多成员指标变量就会变得很慢
# solution：使用更加低级的函数，写入 numpy 数组中，然后结果包装在 DataFrame 中
# 
# 一个对于统计应用更加有效的秘诀，结合 get_dummies 和 cut 之类的离散化函数

np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [19]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [20]:
# 字符串操作

# 简单易用的字符串和文本处理功能
# 大部分文本运算直接做成了字符串对象的内置方法
# 对于复杂的模式匹配和文本操作，则需要正则表达式

# pandas 对此 Python 的优势进行了增强，
# 能够对整组数据应用字符串表达式和正则表达式

# 字符串对象方法
# 1 以逗号分隔的字符串可以用 split 拆分
val = "a,b, guide"
val.split(',')

['a', 'b', ' guide']

In [21]:
# 2 split and strip ,去除空白符（包括换行符）
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guide']

In [23]:
# 利用 加法 可以将子字符串以双冒号分隔符的形式连接起来
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guide'

In [24]:
# 一种更简便方式，向字符串 "::" 的join 方法传入一个列表或者元组
"::".join(pieces)

'a::b::guide'

In [25]:
# 还关注子字符串的定位
# 检测子字符串的最佳方法利用 Python in 关键字，还有index 和 find
'guide' in val

True

In [26]:
val.index(',')

1

In [27]:
val.find(':')

-1

In [28]:
# 注意find和index的区别： 如果找不到字符串， index将会引发一个异常（而不是返回－1） 

# count 可以返回指定子字符串出现的次数
val.count(',')

2

In [29]:
# replace 用于将指定模式替换为另一个模式
val.replace(',', '::')

'a::b:: guide'

In [30]:
# 通过传入空串，常用于删除模式
val.replace(',', '')

'ab guide'

In [31]:
# python 内置的字符串方法
# 方法                   说明
# count                  返回子串在字符串中的出现次数(非重叠)
# endswith、startswith   如果 字符串以某个后缀结尾(以某个前缀开头)，则返回True
# join                   将字符串用作连接其他字符串序列的分隔符
# index                  如果在字符串中找到子串，则返回子串第一个字符所在的位置。如果没有找到，则引发ValueError。
# find                   如果在字符串中找到子串，则返回第一个发现的子串的第一个字符所在的位置。如果没有找到，则返回-1
# rfind                  如果在字符串中找到子串，则返回最后一个发现的子串的第-个字符所在的位置。如果没有找到，则返回一1
# replace                用另一个字符串替换指定子串
# strip、rstrip、 lstrip 去除空白符(包括换行符)。相当于对各个元素执行x.strip()(以及rstrip、Istrip) 。
# split                  通过指定的分隔符将字符串拆分为一组子串
# lower、upper           分别将字母字符转换为小写或大写
# ljust、rjust           用空格(或其他字符)填充字符串的空白侧以返回符合最低宽度的字符串

In [32]:
# 正则表达式
# 正则表达式提供了一种灵活的在文本中搜索或匹配（通常比前者复杂）字符串模式的方式
# 正则表达式， 常称作 regex ，根据正则表达式语言编写的字符串
# Python内置的 re 模块负责对字符串应用正则表达式
# 
# re模块的函数可以分为三个大类： 模式匹配、 替换以及拆分 当然， 它们之间是相辅相成的。 
# 一个regex描述了需要在文本中定位的一个模式，它可以用于许多目的

# 一个简单的例子：拆分一个字符串，分隔符为数量不定的一组空白符（制表符、 空格、 换行符等）
# 描述一个或多个空白符的 regex 是 \s+ 
import re

text = "foo bar\t baz \tqux"

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [33]:
# 上一条语句执行情况：首先正则表达式被编译，然后在text上调用其split 方法
# 等价于以下语句
# compile
regex = re.compile('\s+')
# match
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [34]:
# if want the match of all for regex, and then using the method of findall
# 想要匹配到所有 regex 的所有模式，使用 findall 方法
regex.findall(text)

[' ', '\t ', ' \t']

In [35]:
# 笔记： 如果想避免正则表达式中不需要的转义（\），
#       则可以使用原始字符串字面量如 r'C:\x'（也可以编写其等价式'C:\x'）

# 如果打算对许多字符串应用同一条正则表达式， 
# 强烈建议通过re.compile创建regex对象。 这样将可以节省大量的CPU时间。

# match 和 search 跟 findall 功能类似。
# findall返回的是字符串中所有的匹配项， 
# 而 search 则只返回第一个匹配项。 
# match 更加严格， 它只匹配字符串的首部

# 一个小例子， 假设有一段文本以及一条能够识别大部分电子邮件地址的正则表达式：
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
# re.IGNORECASE  使正则表达式不区分大小写
regex = re.compile(pattern, flags=re.IGNORECASE)

# 对text 使用 findall 将得到一组电子邮件
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [36]:
# search 返回的是文本中第一个电子邮件地址
m = regex.search(text)
m

In [37]:
text[m.start():m.end()]

'dave@google.com'

In [39]:
# 由于 match 只匹配出现字符串开头的模式，返回一定为空None
print(regex.match(text))

None

In [40]:
# sub 方法将匹配到的模式替换为指定字符串，并返回所得到的新字符串
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [41]:
# 不仅想要找出电子邮件地址，还想将各个地址分成3个部分： 用户名、 域名以及域后缀
# 实现此功能， 只需将待分段的模式的各部分用圆括号包起来即可
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

# 由这种修改过的正则表达式所产生的匹配项对象，可以通过其 groups 方法返回一个由 模式各段 组成的元组：
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [42]:
# 对于带有分组功能的模式， findall会返回一个元组列表
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [43]:
# sub还能通过诸如\1、 \2 之类的特殊符号访问各匹配项中的分组
# 符号 \1 对应第一个匹配的组， \2 对应第二个匹配的组， 以此类推
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [44]:
# Python 中 正则表达式 方法

# 方法               说明
# findall、finditer  返回字符串中所有的非重叠匹配模式。findall返回的是由所有模式组成的列表，而finditer则通过一个迭代器逐个返回
# match              从字符串起始位置匹配模式，还可以对模式各部分进行分组。如果匹配到模式，则返回一个匹配项对象，否则返回None
# search             扫描整个字符串以匹配模式。如果找到则返回一个匹配项对象。跟match不同，其匹配项可以位于字符串的任意位置，而不仅仅是起始处
# split              根据找到的模式将字符串拆分为数段
# sub、subn          将字符串中所有的(sub) 或前n个(subn) 模式替换为指定表达。在替换字符串中可以通过\1、\2等符号表示各分组项

In [45]:
# pandas 矢量化字符串函数

# 清理待分析的散乱数据时，需要对字符串做规整化操作
# 更加复杂是是，含有字符串的列还含有缺失数据
data = {'Dave': 'dave@google.com', 
        'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 
        'Wes': np.nan}

data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [46]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [47]:
# 通过data.map， 所有字符串和正则表达式方法都能被应用于（传入lambda表达式或其他函数） 各个值，
# 但是如果存在 NA（null） 就会报错。 
# 为了解决这个问题， Series有一些能够跳过 NA值的面向数组方法， 进行字符串操作。 
# 通过Series的 str 属性即可访问这些方法。 

# 例如， 可以通过 str.contains 检查各个电子邮件地址是否含有"gmail"：
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [48]:
# 也可以使用正则表达式， 还可以加上任意re选项（如IGNORECASE） ：
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [49]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [53]:
# 有两个办法可以实现矢量化的元素获取操作： 要么使用str.get， 要么在str属性上使用索引：
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [60]:
# 要访问嵌入列表中的元素， 我们可以传递索引到这两个函数中：
print(type(matches))
matches.str.get(1)

<class 'pandas.core.series.Series'>

AttributeError: Can only use .str accessor with string values!

In [56]:
data.matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [57]:
# 可以利用这种方法对字符串进行截取：
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [61]:
# pandas 字符串方法

# 方法         说明
# cat          实现元素级的字符串连接操作，可指定分隔符
# count        返回表示个字符串是否含有指定模式的布尔型数组
# extract      使用带分组的正则表达式从字符串Series提取一个或多个字符串,结果是一个DataFrame,每组有一-列
# endswith     相当于对每个元素执行x.endswith(patterm)
# startswith   相当于对每个元素执行x.startswith(pattern)
# findall      计算各字符串的模式列表
# get          获取各元素的第i个字符
# isalnum      相当于内置的str.alnum
# isalpha      相当于内置的str.isalpha
# isdecimal    相当于内置的strisdecimal
# isdigit      相当于内置的str.isdigit
# islower      相当于内置的str.islower
# isnumeric    相当于内置的str.isnumeric
# isupper      相当于内置的str.isupper
# join         根据指定的分隔符将Series 中各元素的字符串连接起来
# len          计算各字符串的长度
# lower,upper  转换大小写。相当于对各个元素执行x.lower()或 x.upper()
# match        根据指定的正则表达式对各个元素执行re.match，返回匹配的组为列表
# pad          在字符串的左边、右边或两边添加空白符
# center       相当于pad(side='both')
# repeat       重复值。例如，s.str.repeat(3)相当于对各个字符串 执行x*3
# replace      用指定字符串替换找到的模式
# slice        对Series中的各个字符串进行子串截取
# split        根据分隔符或正则表达式对字符串进行拆分
# strip        去除两边的空白符，包括新行
# rstrip       去除右边的空白符
# lstrip       去除左边的空白符